<?php get_header('link'); ?>
<link rel="stylesheet" href="<?php echo get_template_directory_uri() ?>/assets/CSS/profile.css" />


<main>
  <h1 class="title">私の事</h1>
  <div class="display">
    <div class="section" id="section1"></div>
    <div class="portrait">
      <img class="img" src="<?php echo get_template_directory_uri() ?>/assets/img/nigaoe.PNG" alt="似顔絵" />
      <div class="history">
        <h2>自己紹介</h2>
        <p>1991年　徳島県勝浦郡勝浦町生まれ<br>　学生の頃から接客業務、生命保険の営業、金融窓口事務などお金にまつわる業務をそれぞれ務めておりました。コンビニや本屋などでレジ打ちを通して接客業務に携わり、コミュニケーション能力を培ってきました。
          　その経験のお陰で生命保険の営業で、新規顧客開拓に役立ちました。顧客のニーズを丁寧にヒアリングし、課題解決に繋がる提案をすることで、顧客満足度向上に貢献しました。
          　また金融窓口事務では、入出金や定期預金、口座開設などといった窓口業務、電話対応やデータ入力、書類作成と幅広い業務に携わってきました。ペーパーレス化はもちろん、個人情報の管理や出納記録の二重チェックなど安全面や業務効率を向上させ、作業時間の削減に貢献しました。これらの経験を活かし、御社でも経理業務における正確かつ効率的な業務遂行に貢献していきたいと考えています。
        </p>
      </div>
    </div>
    <div class="career section" id="section2">
      <h2>経歴</h2>
      <ul>
        <li>ペット事業 平成24年～26年</li>
        <li>生命保険営業 平成26年～29年</li>
        <li>金融窓口事務 平成29年～令和4年</li>
        <li>発達障害の治療のため休職 令和4年～令和6年</li>
        <li>IT関係の職業訓練 令和6年11月～</li>
      </ul>
    </div>
    <div class="career section" id="section3">
      <h2>スキル</h2>
      <p>デザインツール: Adobe Illustrator、Photoshop、Figmaなどの主要なデザインソフトを習得し、ロゴデザインやプロトタイプの作成を行っています。
        Web制作: HTML、CSSを用いたコーディングを職業訓練で学び、レスポンシブデザインの実装も可能です。また、基本的なJavaScriptを用いて、簡単なアプリも制作したこともあります。
      </p>


    </div>
    <div class="career section" id="section4">
      <h2>自己PR</h2>
      <p>私の強みは、問題解決能力です。過去の職務経験を通じて、多様な意見や立場を尊重しつつ、チーム全体での最良の結果を導き出す力を身につけました。また、粘り強く問題解決に取り組む姿勢も評価されてきました。最初は思うようにプログラムが動いてくれず、何度も試行錯誤を繰り返し、参考サイトやYouTubeなどで独自に調べたり先生やチャットGTPなどにも聞いてエラー解決に取り組みました。デザイン制作においては、ユーザー視点を重視し、細部までこだわることで、ユーザーにとって使いやすく、視覚的にも優れた成果を提供できるよう心がけています。</p>
    </div>
    <div class="career section" id="section5">
      <h2>職業訓練で学んだ事</h2>

      <p>わずか６ヵ月でPhotoshop、HTML5、CSS3、Javascript、mySQL、PHP、およびWordPressを学びました。 YouTubeや参考サイトなどをみて訓練開始より前から独学で勉強しておりましたが、知識の片寄りや経験の浅さの懸念がありました。知っている部分もあって訓練の内容として比較的すんなりと、知識や情報を照らし合わせながら書き換えることで対応できました。
        知識の片寄りや経験の浅さに臆することなくHTML、CSS、Javascriptまで初学者として必死に授業に付いていけるようソースを打ち出して表示画面と比較しながら覚えていくようにしました。そして、現在実装されているWEBサイトやアプリ等を拝見してデベロッパーツールやチャットGTPなどを使って比較し、少しでも疑問や仕組みを拝見し再現したりしました。自分の思うようにコードが機能した時や自分が書いたコードや作ったアプリを先生や同級生に見せて意見を聞いたりしてさらに改良を加えたりそれをほめてもらえた時が一番楽しく感じました。WordPressでは動的にサイトを作る面白さと便利さを学び、いつか自分でもWEBサイトを作りたいと思いました。
      </p>
    </div>


  </div>

</main>

<?php get_footer(); ?>
